{
  "backend/main.mo": "Motoko canister storing messages by caller principal with submit, lookup, and list APIs.",
  "feature_evidence.json": "Feature evidence report mapping UI changes to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to brief descriptions used for build planning.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme tokens, dark mode variables, and global background/text rules.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main React router configuration wiring all site pages into a shared layout.",
  "frontend/src/components/home/FeaturedStoriesCarousel.tsx": "Carousel component that cycles through featured stories with navigation controls and indicators.",
  "frontend/src/components/home/HomeCategoriesGrid.tsx": "Grid of category cards with icons and hover effects for the homepage.",
  "frontend/src/components/home/LuxuryFeaturedStoryCard.tsx": "Enhanced featured story card with premium shadow, hover animation, and link to story detail.",
  "frontend/src/components/home/NewsletterStrip.tsx": "Renders a subscription form with email input and a temporary success message after submission.",
  "frontend/src/components/layout/Footer.tsx": "Displays site footer with branding, quick links, optional social links, and copyright info.",
  "frontend/src/components/layout/Header.tsx": "Provides a responsive site header with navigation links, login/signup buttons, and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site structure with header, footer, and routed page content.",
  "frontend/src/components/stories/StoryCard.tsx": "Shows a story preview card with title, metadata, tags, and links to the full story.",
  "frontend/src/data/stories.ts": "Defines the Story interface and exports a sample list of story objects.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useContactSubmit.ts": "Provides logic to submit contact form data to the backend actor with status tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and identity management.",
  "frontend/src/hooks/useQueries.ts": "Provides a React Query hook that fetches all messages from the backend actor when available.",
  "frontend/src/hooks/useStoriesFilter.ts": "Filters stories by category and search query using memoization.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, theme variables, dark mode settings, and base typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, and creator information using styled sections.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission handling, and contact details display.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero banner, featured stories, categories section, and newsletter strip.",
  "frontend/src/pages/LoginPage.tsx": "Manages Internet Identity login flow and renders login UI with status handling and redirects.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the site's privacy policy with sections on data collection, usage, cookies, third-party services, and protections.",
  "frontend/src/pages/SignupPage.tsx": "Implements signup flow using Internet Identity, handling login state, errors, and redirection.",
  "frontend/src/pages/StoriesPage.tsx": "Displays all stories with search, category filtering, active filter badges, and a responsive story grid.",
  "frontend/src/pages/StoryDetailPage.tsx": "Shows detailed story content by slug, including metadata, tags, and navigation back to the stories list.",
  "frontend/src/pages/TermsPage.tsx": "Renders the site's terms and conditions with sections on content use, conduct, IP, privacy, and disclaimers.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with typography, container queries, custom colors, fonts, animations, and extended theming.",
  "project_state.json": "Tracks project versioning and design requirements, including homepage UI refinements, new routes, theme direction, and known content inconsistencies. Also lists existing features, image update needs, and architectural notes for ongoing development."
}