{
  "backend/main.mo": "Motoko canister storing user-submitted messages keyed by caller principal with methods to submit, fetch one, or fetch all messages.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for reference.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining light and dark themes and global element styling.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all main pages and wraps them in the SiteLayout.",
  "frontend/src/components/home/FeaturedStoriesCarousel.tsx": "Carousel component showing featured stories with navigation controls and links to story detail pages.",
  "frontend/src/components/layout/Footer.tsx": "Site footer displaying brand info, quick links including Terms, and optional social links with attribution.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation links, login/signup buttons, and a toggleable mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the app with a header, footer, and main content area using React Router's Outlet.",
  "frontend/src/components/stories/StoryCard.tsx": "Displays a story preview card with category, date, excerpt, tags, and links to the story page.",
  "frontend/src/data/stories.ts": "Defines the Story interface and provides a static list of story objects with metadata and content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useContactSubmit.ts": "Handles submitting contact messages through the backend actor with success and error state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides a query hook to fetch all messages from the backend actor using React Query.",
  "frontend/src/hooks/useStoriesFilter.ts": "Filters stories by category and search query using memoized logic.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, global styles, and utility layers for light/dark modes.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission, values, and creator sections for stories.pk using static text and icons.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and submission plus static contact info and office hours.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section, featured stories carousel, and CTA sections.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login via Internet Identity, including redirect logic, login button, and error states.",
  "frontend/src/pages/SignupPage.tsx": "Provides signup flow using Internet Identity with similar logic to login, including redirects and errors.",
  "frontend/src/pages/StoriesPage.tsx": "Lists all stories with search and category filtering and renders results using StoryCard components.",
  "frontend/src/pages/StoryDetailPage.tsx": "Displays a full story by slug with header metadata, body paragraphs, and navigation, and shows a not-found state if missing.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page using a card layout with multiple policy sections and contact info.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Describes the project’s state, requirements, architecture, known issues, and planned features for the stories.pk site."
}