{
  "backend/main.mo": "Stores messages keyed by caller principal and provides submit, get by id, and list-all APIs.",
  "feature_evidence.json": "Feature evidence report describing an icon-style update tied to HomeCategoriesGrid.tsx.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional summaries.",
  "frontend/index.css": "Global Tailwind base layer with CSS variables for themes, dark mode values, and base styling.",
  "frontend/index.html": "HTML entry point defining root mount element and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all main pages wrapped in SiteLayout.",
  "frontend/src/components/home/FeaturedStoriesCarousel.tsx": "Carousel component that cycles through featured stories with navigation controls.",
  "frontend/src/components/home/HomeCategoriesGrid.tsx": "Grid of predefined categories using solid custom SVG icons with luxury black‑and‑white styling.",
  "frontend/src/components/home/LuxuryFeaturedStoryCard.tsx": "Styled story card showing metadata, excerpt, and link to detail page with luxury theme effects.",
  "frontend/src/components/home/NewsletterStrip.tsx": "Newsletter signup strip with email input, subscription state, and success message UI.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, quick links, optional social links, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Implements the site header with navigation, login/signup buttons, and a responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the page with a header, footer, and main Outlet region.",
  "frontend/src/components/stories/StoryCard.tsx": "Displays a story preview card showing category, date, title, excerpt, tags, and a Read More link.",
  "frontend/src/data/stories.ts": "Defines the Story interface and exports a list of example story objects.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useContactSubmit.ts": "Provides contact form submission logic using the backend actor with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling authentication, stored identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines a query hook to fetch all messages from the backend actor.",
  "frontend/src/hooks/useStoriesFilter.ts": "Filters stories by category and search query using memoization.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, plus base typography and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, and platform description using styled sections and icons.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission handling, and contact details display.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section, featured stories, and category navigation.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login interface using Internet Identity with redirect logic and loading/error states.",
  "frontend/src/pages/PrivacyPage.tsx": "Shows the site's privacy policy with sections describing data collection and usage.",
  "frontend/src/pages/SignupPage.tsx": "Signup page handling Internet Identity login, redirecting on success, and showing authenticated or signup UI states.",
  "frontend/src/pages/StoriesPage.tsx": "Stories listing page with search, category filtering, active filter badges, and a responsive story grid.",
  "frontend/src/pages/StoryDetailPage.tsx": "Displays a single story’s details with category, tags, metadata, body content, and navigation back to the stories list.",
  "frontend/src/pages/TermsPage.tsx": "Static Terms & Conditions page rendered inside a card layout with multiple policy sections.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, container settings, animations, and plugin usage.",
  "project_state.json": "Project metadata describing design direction, routes, homepage refinement tasks, and known content inconsistencies."
}