{
  "kind": "build_request",
  "title": "Update Home “Explore by Category” icons to solid minimal black-and-white style",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Update the icon style used in the Home page “Explore by Category” section (rendered by `frontend/src/components/home/HomeCategoriesGrid.tsx`) so all category sub-icons look professional, solid/filled, clean, and minimal in an elegant black-and-white luxury theme, without changing the existing layout, spacing, category count/order, or text content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Please update the “Explore by Category” section.\nI would like all the category icons (the sub-icons under Explore by Category) to have a professional look \nMake them solid clean, and minimal. Keep the design elegant and consistent with the black-and-white luxury theme. Do not change the layout — only update the icon style."
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, the “Explore by Category” section renders the same grid layout as before (same column behavior, card structure, spacing, and typography).",
        "All category icons appear as solid/filled, minimal, and consistent in style (no mixed outline vs solid styles).",
        "Icons use a black-and-white presentation consistent with the luxury theme (no colored accents for the icon glyphs).",
        "No other Home page sections (Hero, Featured Stories, About, Newsletter) or other routes/pages are visually or functionally changed."
      ]
    }
  ],
  "constraints": [
    "Do not change the Home page “Explore by Category” grid/card layout; only change icon style/appearance.",
    "Keep category names and descriptions in English and unchanged.",
    "Limit changes to the Home page categories icons (component: `frontend/src/components/home/HomeCategoriesGrid.tsx`) and any necessary supporting styles; do not modify immutable frontend paths."
  ],
  "nonGoals": [
    "Adding/removing categories or changing their order.",
    "Changing the “Explore by Category” heading/subheading text, card copy, or any non-icon styling beyond what is strictly necessary to support the new icon style.",
    "Backend changes or new APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}